In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.DataFrame(data=pd.read_csv('Lab3.csv'))
print(data)

      Name  Age Gender  Marks
0      Jai   17      M   90.0
1   Princy   17      F   76.0
2   Gaurav   18      M    NaN
3     Anuj   17      M   74.0
4     Ravi   18      M   65.0
5  Natasha   17      F    NaN
6     Riya   17      F   71.0

In [3]:
df = pd.DataFrame(data)
df

      Name  Age Gender  Marks
0      Jai   17      M   90.0
1   Princy   17      F   76.0
2   Gaurav   18      M    NaN
3     Anuj   17      M   74.0
4     Ravi   18      M   65.0
5  Natasha   17      F    NaN
6     Riya   17      F   71.0

In [4]:
avg = print(df.mean(numeric_only=True))

Age      17.285714
Marks    75.200000
dtype: float64

In [5]:
df['Marks'].fillna('75.2',inplace=True)
df

      Name  Age Gender Marks
0      Jai   17      M  90.0
1   Princy   17      F  76.0
2   Gaurav   18      M  75.2
3     Anuj   17      M  74.0
4     Ravi   18      M  65.0
5  Natasha   17      F  75.2
6     Riya   17      F  71.0

In [6]:
df['Gender'] = df['Gender'].map({'M': 0,
                                 'F': 1, }).astype(float)

df

      Name  Age  Gender Marks
0      Jai   17     0.0  90.0
1   Princy   17     1.0  76.0
2   Gaurav   18     0.0  75.2
3     Anuj   17     0.0  74.0
4     Ravi   18     0.0  65.0
5  Natasha   17     1.0  75.2
6     Riya   17     1.0  71.0

In [7]:
df = df[df['Marks'].astype(float) >= 75].copy()

df.drop('Age', axis=1, inplace=True)

df

      Name  Gender Marks
0      Jai     0.0  90.0
1   Princy     1.0  76.0
2   Gaurav     0.0  75.2
5  Natasha     1.0  75.2

In [11]:
import pandas as pd

details = pd.DataFrame({
    'ID': [101,102,103,104,105,106,107,108,109,110],
    'NAME': ['Navjot', 'Paramjot', 'Harjot', 'Gurjot', 'Jagjot', 'Jeevanjot', 'Ayush', 'Ashu', 'Isha', 'Sania'],
    'BRANCH': ['CSE','CSE','CSE','CSE','CSE','CSE','CSE','CSE','CSE','CSE']
    
})
print(details)

    ID       NAME BRANCH
0  101     Navjot    CSE
1  102   Paramjot    CSE
2  103     Harjot    CSE
3  104     Gurjot    CSE
4  105     Jagjot    CSE
5  106  Jeevanjot    CSE
6  107      Ayush    CSE
7  108       Ashu    CSE
8  109       Isha    CSE
9  110      Sania    CSE

In [10]:
import pandas as pd

fees_status = pd.DataFrame({
    
  'ID': [101,102,103,104,105,106,107,108,109,110],
  'PENDING': ['5000','250','NIL','9000','15000','NIL','4500','1800','250','NIL',]
})
print(fees_status)

    ID PENDING
0  101    5000
1  102     250
2  103     NIL
3  104    9000
4  105   15000
5  106     NIL
6  107    4500
7  108    1800
8  109     250
9  110     NIL

In [12]:
 details = pd.DataFrame({
    'ID': [101,102,103,104,105,106,107,108,109,110],
    'NAME': ['Navjot', 'Paramjot', 'Harjot', 'Gurjot', 'Jagjot', 'Jeevanjot', 'Ayush', 'Ashu', 'Isha', 'Sania'],
    'BRANCH': ['CSE','CSE','CSE','CSE','CSE','CSE','CSE','CSE','CSE','CSE']
    
})
    
fees_status = pd.DataFrame({
    
  'ID': [101,102,103,104,105,106,107,108,109,110],
  'PENDING': ['5000','250','NIL','9000','15000','NIL','4500','1800','250','NIL',]
})

print(pd.merge(details, fees_status, on = 'ID'))

    ID       NAME BRANCH PENDING
0  101     Navjot    CSE    5000
1  102   Paramjot    CSE     250
2  103     Harjot    CSE     NIL
3  104     Gurjot    CSE    9000
4  105     Jagjot    CSE   15000
5  106  Jeevanjot    CSE     NIL
6  107      Ayush    CSE    4500
7  108       Ashu    CSE    1800
8  109       Isha    CSE     250
9  110      Sania    CSE     NIL